In [1]:
import pandas as pd

###### 1. Import csv file

In [3]:
df=pd.read_csv("https://gist.githubusercontent.com/Kimmirikwa/b69d0ea134820ea52f8481991ffae93e/raw/4db7b1698035ee29885d10e1a59bd902716ae168/student_results.csv")

In [12]:
df.head()

,id,name,phone,sex and age,test number,term 1,term 2,term 3,sex,age
0,1,Mike,134,m_12,test 1,76,84,87,Male,12
1,2,Linda,270,f_13,test 1,88,90,73,Female,13
2,3,Sam,210,m_11,test 1,78,74,80,Male,11
3,4,Esther,617,f_12,test 1,68,75,74,Female,12
4,5,Mary,114,f_14,test 1,65,67,64,Female,14

###### 2. Split sex and age field into two seperate columns and tidy them up for further analysis

In [9]:
df['sex'] = df["sex and age"].str[:1].replace("m","Male").replace("f","Female")

In [11]:
df['age'] = df["sex and age"].str[2:]

###### 3. Analyze the average score by sex

In [15]:
df.groupby("sex")["term 1","term 2","term 3"].mean().round(2)

<ipython-input-15-c8cfcc5eaea6>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df.groupby("sex")["term 1","term 2","term 3"].mean().round(2)

        term 1  term 2  term 3
sex
Female   74.33   76.50   74.33
Male     79.75   81.25   84.25

###### 4. Analyze the average score by age

In [16]:
df.groupby("age")["term 1","term 2","term 3"].mean().round(2)

<ipython-input-16-944c11d25b11>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df.groupby("age")["term 1","term 2","term 3"].mean().round(2)

     term 1  term 2  term 3
age
11    79.00    80.5   80.00
12    74.75    78.5   82.25
13    87.50    86.0   83.50
14    66.50    68.5   63.50